<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1d5b7396721ca7aace9a565553bcd1dd95c9d7694d00d0b2090db917e72fbb40","plan_job_ref":"Job Create terraform plan #38 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7174318007","plan_hash":"e5f065df96d2ff6f5c102d7b04d3666c0c8b5124bb291855b860439d4683965c","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/49e330e2b21369b7f3b74bd54ac24c3e3e31dd6608a4b7f695aad47861d43edd.zip" -> "builds/88a8bc286e1affe518907e987b32b1b52cb463dd8ed1f5bdb1fd8fc114496ef8.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-12-08T23:54:42.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:24" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:24/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "24" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "24" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/88a8bc286e1affe518907e987b32b1b52cb463dd8ed1f5bdb1fd8fc114496ef8.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/88a8bc286e1affe518907e987b32b1b52cb463dd8ed1f5bdb1fd8fc114496ef8.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/49e330e2b21369b7f3b74bd54ac24c3e3e31dd6608a4b7f695aad47861d43edd.zip" -> "builds/88a8bc286e1affe518907e987b32b1b52cb463dd8ed1f5bdb1fd8fc114496ef8.zip"
          ~ "timestamp" = "1702079671066851000" -> "1702334808061354000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #38](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7174318007)